import { useMemo, useState } from "react";
import FaqView from "./faq.view";

const _categories = [
  {
    title: "بیت‌برگ",
    items: [
      {
        title: "کریپو چیست؟",
        lines: [
          "کریپو مجموعه‌ای دانش بنیان در زمینه ارزهای دیجیتال است که از سال ۱۳۹۷ با هدف فراهم آوردن بستری امن و سریع برای خرید و فروش ارزهای دیجیتال شروع به کار کرده است.",
        ],
      },
      {
        title: "کریپو چه خدماتی به مشتریان ارائه می دهد؟",
        lines: [
          "- خرید و فروش انواع ارزهای دیجیتال",
          "- ارائه حواله های دانشجویی خرد و کلان در قالب Crypto Currency Transfer",
          "- نمایش قیمت لحظه ای و نمودار ارزهای دیجیتال",
          "- ارائه بستری برای طرح سوال و گفتگو با سایر کاربران پیرامون ارزهای دیجیتال",
          "- تحلیل و مشاوره و ساخت سبد ارزی",
          "- پاسخگویی و پشتیبانی ۲۴ ساعته به صورت تلفنی و آنلاین",
        ],
      },
      {
        title: "مزایای کریپو چیست؟",
        lines: [
          "- ارسال آنی ارز دیجیتال برای کاربران (در خرید دوم به بعد)",
          "- کیف پول ریالی که به شما امکان خرید تا سقف ۲۰۰ میلیون تومان را میدهد و همچنین با فروش ارز به کریپو، بصورت آنی وجه ریالی خود را روی کیف پول ریالی دریافت می‌کنید",
          "- واریز وجه به حساب های بانک آینده، ۱۵ دقیقه بعد از ثبت سفارش فروش (در صورت احراز هویت و تایید شبکه)",
          "- خرید و فروش شبانه روزی، ۷ روز هفته ۲۴ ساعته",
          "- پورتفوی، سبد دارایی ارز دیجیتال",
          "- امنیت و سرعت بالا",
          "- پوشش ارزی بالا تحت تمام شبکه ها",
          "- کاربری ساده و آسان",
          "- پشتیبانی ۲۴ ساعته تلفنی و آنلاین",
        ],
      },
      {
        title: "چگونه با کریپو تماس بگیریم؟",
        lines: [
          "شماره تماس: ۹۱۰۷۹۶۷۷-۰۲۱",
          "شما میتوانید از طریق پشتیبانی آنلاین یا ثبت تیکت نیز با کارشناسان پشتیبانی ما در ارتباط باشید .",
        ],
      },
    ],
  },
  {
    title: "ثبت نام",
    items: [
      {
        title: "چگونه ثبت نام کنم؟",
        lines: [
          "جهت ثبت نام روی دکمه ورود بزنید و شماره تلفن سیمکارتی که بنام خودتان است را وارد نمایید. بعد از دریافت کد ۶ رقمی از طریق  پیامک،  کد را وارد نمایید و سپس رمز عبور ۸ رقمی که ترکیبی از اعداد و حروف انگلیسی می باشد انتخاب و با وارد کردن نام و نام خانوادگی خود فرآیند ثبت نام شما تکمیل خواهد شد.",
          "شما هم اکنون می توانید درخواست خرید یا فروش خود را ثبت کنید.",
        ],
      },
      {
        title: "برای دریافت چه خدماتی نیاز به ثبت نام است؟",
        lines: [
          "جهت خرید و فروش ارز دیجیتال  و استفاده از خدمات همکاران پشتیبانی، نیاز به ثبت نام می باشد. سایر خدمات کریپو بدون ثبت نام در اختیار شما قرار خواهد گرفت.",
        ],
      },
      {
        title: "چگونه میتوانم شماره کارت بانکی خود را در کریپو ثبت کنم؟",
        lines: [
          "برای ثبت کارت بانکی در صفحه اصلی کریپو روی نام کاربریتان در بالای صفحه سمت چپ کلیک کرده، گزینه کارت بانکی را انتخاب و دکمه ثبت کارت جدید را بزنید.",
        ],
      },
      {
        title: "چگونه میتوانم شماره شبای بانکی خود را در کریپو ثبت کنم؟",
        lines: [
          "برای ثبت شبا در صفحه اصلی کریپو روی نام کاربریتان در بالای صفحه سمت چپ انتخاب کرده، روی شبای بانکی انتخاب و شبای مورد نظرتان را ثبت فرمایید .",
        ],
      },
      {
        title: "آیا امکان تغییر شماره همراه فراهم میباشد؟",
        lines: [
          "امکان تغییر شماره وجود ندارد.در نتیجه اگر کارت بانکی داخل حساب کریپو ثبت کردید آن را ابتدا حذف و سپس از حساب کاربری فعلی خارج شوید و با سیمکارتی که متعلق به خودتان است ثبت نام کنید، کریپو حساب کاربری قبلی شما را غیر فعال میکند.",
        ],
      },
    ],
  },
  {
    title: "احراز هویت",
    items: [
      {
        title: "چگونه احراز هویت کنیم؟",
        lines: [
          "با توجه به حجم بالای ثبت نام کاربران در طول روز، این امکان برای کریپو فراهم نیست تا همه کاربران ثبت نامی را احراز هویت نماید. به همین دلیل کریپو تنها کاربرانی را که در سایت درخواست خرید و فروش ثبت کرده اند را احراز هویت می کند.",
          "مدارک و شرایط مورد نیاز برای احراز هویت:",
          "۱- تصویر کارت ملی هوشمند (برای کاربرانی که درخواست کارت ملی هوشمند داده و هنوز دریافت نکرده‌اند، تصویر شناسنامه و برگه درخواست کارت ملی هوشمند در یک تصویر به صورت زنده ارسال شود و امکان آپلود وجود ندارد.)",
          "۲- ارسال ویدئو چند ثانیه ای از چهره خودتان",
          "۳- مالکیت سیمکارتی که با آن در کریپو ثبت نام کردید باید بنام شخص خودتان باشد",
          "۴- داشتن حداقل سن ۱۸ سال و حداکثر ۶۰ سال",
          "۵- افراد دارای معلولیت های ذهنی و جسمی امکان احراز هویت در کریپو را ندارند",
        ],
      },
      {
        title: "احراز هویت چقدر طول می‌کشد؟",
        lines: [
          "احراز هویت خرید شما در کریپو همه روزه حتی در ایام تعطیل از ساعت ۸:۰۰ صبح تا ۱۶:۰۰ عصر توسط کارشناسان تیم احراز هویت بررسی می گردد، که نتیجه بررسی از طریق پیامک خدمتتان اعلام خواهد شد. لازم به توضیح است، در صورتی که احراز هویت از طریق خرید ارز انجام داده اید پس از تایید احراز هویت  بلافاصله ارز به کیف پولتان واریز خواهد شد و در صورتی که احراز هویت از طریق فروش ارز انجام داده باشید  و احراز هویت شما تایید شود  وجه ریالی بر اساس نوع انتخاب تسویه شما در فرآیند ثبت سفارش فروش (تسویه از طریق کیف پول ریالی یا شبای بانکی) پرداخت خواهد شد  و در صورت عدم تایید احراز هویت و یا نقص مدارک ارسالی نیز از طریق پیامک به شما اطلاع داده خواهد شد.",
        ],
      },
      {
        title: "اگر موفق به انجام احراز هویت نشوم چه اتفاقی می افتد؟",
        lines: [
          "در صورتی که کاربری نتواند مدارک هویتی خود را به صورت صحیح ارائه دهد و موفق به انجام احراز هویت نشود، خرید و فروش او پس از گذشت ۱۴ روز از ثبت سفارش کنسل شده و برای عودت وجه نیاز به دستور از سمت مقامات قضایی و انتظامی می باشد.",
        ],
      },
      {
        title: "شرایط احراز هویت برای اتباع خارجی چیست؟",
        lines: [
          "متاسفانه کریپو در حال حاضر امکان سرویس دهی به اتباع خارجی را ندارد.",
        ],
      },
      {
        title: "آیا احراز هویت برای فروش هم الزامی‌است؟",
        lines: [
          "بله  بنا به دستور پلیس فتا فروش در صرافی های ارز دیجیتال نیاز به احراز هویت است. توجه داشته باشد که فرایند احراز هویت مانند خرید، در صورتی که قبلا احراز هويت نشده باشید، بعد از فروش اول انجام خواهد شد.",
        ],
      },
    ],
  },
  {
    title: "خرید",
    items: [
      {
        title: "چگونه می توانم ارز دیجیتال بخرم؟",
        lines: [
          "- ثبت نام کنید  و یا  اگر حساب کاربری دارید وارد حساب شوید.",
          "- در صفحه اصلی نام ارز را انتخاب کنید و مبلغ مورد نظر را با توجه به وضعیت احراز هویت درج کنید.",
          "- بر روی  گزینه درخواست خرید کلیک کنید.",
          "- پیش فاکتور به شما نمایش داده میشود ، در پیش فاکتور شبکه ارز خود را انتخاب کنید.دقت کنید که در مبدا صرافی کریپو و مقصد کیف پول شما شبکه های یکسان را انتخاب کنید.",
          "- بعد از انتخاب شبکه ، موارد درج شده در پیش فاکتور را با دقت مطالعه کنید.",
          "- سپس بر روی گزینه ادامه انتخاب کنید.",
          "- در گام اول خرید قوانین را با دقت مطالعه کنید .",
          "- بر روی ثبت یا انتخاب آدرس کیف پول انتخاب کنید .",
          "- واریز وجه از طریق درگاه بانکی یا کیف پول ریالی را انتخاب کنید .",
          "- در صورتی که این سفارش اولین سفارش کریپو شماست بعد از انجام مراحل خرید احراز هویت کنید.",
        ],
      },
      {
        title: "من از کریپو ارز خریدم.چه زمانی ارز به کیف پول من ارسال می‌شود؟",
        lines: [
          "سامانه پرداخت الکترونیک کریپو، در لحظه ارز مورد نظر شما را خریداری میکند و با توجه به دستور مقامات محترم قضایی و انتظامی، خرید اول واریز ارز بعد از تایید احراز هویت در وقت اداری و خرید های بعدی آنی بعد از ثبت سفارش به کیف پول شما ارسال می گردد.",
          "پس از خرید می توانید از منوی کریپو وارد بخش سفارشات شده و روی سفارش خریدتان کلیک کنید، در فرم سفارشتان زمان واریز ارز را می توانید مشاهده کنید.",
        ],
      },
      {
        title: "آیا امکان لغو سفارش خرید و استرداد وجه وجود دارد؟",
        lines: [
          "از آنجایی که در زمان ثبت سفارش خرید، کریپو در لحظه ارز شما را خریداری میکند امکان لغو سفارش و استرداد وجه وجود ندارد.",
        ],
      },
      {
        title: "از چه کیف پولی استفاده کنیم!؟",
        lines: [
          "کریپو در حال حاضر سرویس کیف پول ارائه نمی‌دهد اما اگر شما به دنبال یک کیف پول امن، سریع و آسان هستید که تنوع گسترده‌ای از آلت کوین ها را پشتیبانی کند، کیف پول تراست ولت  یکی از گزینه‌هایی است که با آن می‌توانید ارزهای دیجیتال را بر روی تلفن همراه خود ذخیره کنید.",
          "برای ساخت کیف پول میتوانید در منو سایت به قسمت ساخت کیف پول مراجعه نمایید.",
        ],
      },
      {
        title: "حداقل میزان خرید از کریپو چقدر است؟",
        lines: [
          "حداقل میزان خرید در بیت‌برگ به جز موارد زیر ۱ میلیون تومان است:",
          "- ارزهای بیت کوین، بایننس کوین و ریپل ۲میلیون تومان",
          "- ارز پولکادات ۵ میلیون تومان",
          "با توجه به بالا بودن کارمزد شبکه بلاکچین انجام معاملات زیر این مبلغ برای کاربران مقرون به صرفه نیست.",
        ],
      },
      {
        title: "معیار زمانی تعیین قیمت سفارش خرید چیست ؟",
        lines: [
          "با توجه به نوسانات لحظه ای در ارزهای دیجیتال، تعیین قیمت نهایی برای خرید ارز در کریپو لحظه ای است که روی درگاه پرداخت بانکی وجه ریالی را پرداخت می کنید.",
        ],
      },
      {
        title: "آیا امکان خرید حضوری از بیت‌برگ وجود دارد؟",
        lines: ["کریپو خرید و فروش حضوری ارائه نمیدهد."],
      },
      {
        title: "آیا محدودیتی برای میزان خرید از بیت‌برگ وجود دارد؟",
        lines: [
          "گاهی اوقات بدلیل افزایش تقاضای خرید از سوی کاربران، ممکن است سقف خرید روزانه بصورت موقت محدود شود. لازم به ذکر است در روزهای عادی محدودیتی برای خرید وجود ندارد و تا سقف ۵۰ میلیون تومان به ازای هر کارت بانکی و در مجموع ۱۰۰ میلیون تومان برای هر نفر از طریق درگاه بانکی (مطابق محدودیت های اعمال شده از سوی بانک مرکزی) می توانید خرید داشته باشید.",
          "برای خرید بالاتر از یکصد میلیون تومان در روز میتوانید از طریق صفحه ارتباط با مدیریت درخواست خود را مطرح نمایید.",
        ],
      },
      {
        title: "ساعت های مجاز به انجام معامله در بیت‌برگ چه ساعتی است؟",
        lines: [
          "انجام معاملات خرید و فروش در کریپو حتی در ایام تعطیل ۲۴ ساعته است.",
        ],
      },
      {
        title: "کارمزد خرید در بیت‌برگ چگونه محاسبه می‌شود؟",
        lines: [
          "مقدار کارمزد خرید زمان ثبت سفارش از قسمت پیش فاکتور به صورت ریالی قابل مشاهده می باشد که به همان مقدار ریال از ارز دریافتی کاربر تحت عنوان کارمزد خرید کسر خواهد شد.",
        ],
      },
    ],
  },
  {
    title: "فروش",
    items: [
      {
        title: "چگونه ارز دیجیتال خود را در کریپو بفروشم؟",
        lines: [
          "- ثبت نام کنید و یا اگر حساب کاربری دارید وارد حساب کاربری شوید.",
          "- نام ارز مورد نظر را جستجو و انتخاب کنید.",
          "- مبلغی که قصد فروش به کریپو را دارید بر حسب  تومان در کادر تومان درج کنید دقت داشته باشید حداقل میزان فروش ۳۵۰ هزار تومان و حداکثر ده میلیارد تومان در روز است.",
          "- بر روی گزینه  درخواست فروش کلیک کنید.",
          "- پیش فاکتور برای شما نمایش داده میشود.",
          "- در پیش فاکتور شبکه مورد نظر انتخاب کنید (دقت کنید در مبدا کیف پول شما و در مقصد صرافی کریپو شبکه ها را یکسان انتخاب کنید) .",
          "- مبلغ تقریبی و زمان واریز وجه را با دقت مشاهده کنید سپس بر روی ادامه کلیک کنید.",
          "- در گام اول فروش روش تسویه را انتخاب کنید اگر قصد دارید وجه به کیف ریالی شما در کریپو وارد شود گزینه واریز آنی یعنی واریز به کیف پول ریالی را انتخاب کنید و در غیر این صورت اگر تمایل به انتقال وجه به شبای بانکی خود را دارید گزینه واریز به شبا را بزنید و شبای مورد نظر را انتخاب کنید و سپس گزینه مرحله بعد را بزنید.",
          "- در گام دوم فروش آدرسی که میباست ارز خود را به آن انتقال دهید را مشاهده میکنید.",
          "- اگر آدرس تک  بخشی است از گزینه کپی که در کنار آدرس درج شده استفاده کنید اگر آدرس ارز دو بخشی است و داری تگ یا ممو است یک بار آدرس را کپی و در کیف خود درج کنید و یک بار مجدد تگ را کپی و در کیف خود درج کنید.",
          "(هشدار:  در صورتی که تگ را به هر دلیلی درج نکنید یا اشتباه وارد کنید  ارز شما از دست میرود.)",
          "- وارد کیف خود شوید و ارزی که قصد فروش آن به کریپو را دارید انتخاب کنید.",
          "- بر روی گزینه  Send / withdrawal انتخاب کنید.",
          "- آدرس کریپو را درج کنید و ارز را به کریپو انتقال دهید.",
          "- زمانی که ارز از کیف شما کسر شد گزینه  ثبت نهایی  را درون سایت کریپو انتخاب کنید ..",
        ],
      },
      {
        title: "زمان واریز ریال در کریپو به چه صورت است؟",
        lines: [
          "به شرط احراز هویت و تایید تراکنش در شبکه بلاکچین ، در صورتی که زمان ثبت سفارش تسویه از طریق کیف پول ریالی را انتخاب کنید، سامانه پرداخت الکترونیک کریپو به صورت آنی واریز ریال را انجام میدهد . ",
          "در صورتی که زمان ثبت سفارش تسویه از شبای بانکی را انتخاب کنید، بانک آینده: 15 دقیقه پس از تایید شبکه و سایر بانک ها طبق قانون پایا بانک مرکزی در سه نوبت 04‪:‬00 بامداد، 11‪:‬00 صبح، 14‪:‬00 بعدازظهر و 19‪:‬00 عصر در روزهای کاری واریز انجام میشود. لازم به ذکر است که در روزهای تعطیل پایا از سمت بانک انجام نخواهد شد و واریز آن به ابتدای روز کاری آتی موکول میگردد.",
          "(لازم به ذکر است مبنای تسویه هر سفارش پیش فاکتور بوده و شما کاربر گرامی می توانید هنگام فروش و در پیش فاکتور هرگونه تغییر در زمان تسویه را مشاهده فرمایید.)",
        ],
      },
      {
        title: "حداقل فروش در کریپو چقدر است؟",
        lines: [
          "حداقل فروش در بیت‌برگ معادل ۳۵۰ هزار تومان است. با توجه به بالا بودن کارمزد شبکه بلاکچین انجام معاملات زیر این مبلغ برای کاربران مقرون به صرفه نیست.",
        ],
      },
      {
        title: "آیا امکان فروش حضوری به کریپو وجود دارد؟",
        lines: ["کریپو خرید و فروش حضوری ارائه نمیدهد."],
      },
      {
        title: "آیا محدودیتی برای فروش در کریپو وجود دارد؟",
        lines: [
          "سقف فروش برای هر کاربر در روز ۱۰ میلیارد تومان است. برای معاملات بالاتر از این مبلغ نیاز به هماهنگی قبلی بوده که به این منظور می توانید از طریق منو سایت و قسمت ارتباط با مدیریت درخواست خود را مطرح نمایید.",
        ],
      },
      {
        title: "ساعت های مجاز به انجام معامله در بیت‌برگ چه ساعتی است؟",
        lines: [
          "انجام معاملات خرید و فروش در کریپو حتی در ایام تعطیل نیز ۲۴ ساعته است.",
        ],
      },
      {
        title: "آیا امکان لغو سفارش فروش بعد از انتقال ارز وجود دارد؟",
        lines: [
          "با توجه به اینکه بعد از ثبت درخواست فروش، ارز ارسالی کاربر جهت دریافت تایید شبکه وارد شبکه بلاکچین خواهد شد، امکان لغو سفارش فروش نیست .",
        ],
      },
      {
        title: "معیار زمانی تعیین قیمت فروش چیست؟",
        lines: [
          "تعیین قیمت نهایی برای فروش ارز در کریپو، لحظه ای است که شناسه تراکنش شما در شبکه بلاکچین تایید نهایی شود یعنی به تعداد تایید یا کانفرمی برسد که ارز مورد نظر در کیف پول کریپو قابل دسترسی شود.",
          "لازم به ذکر است تمام جزییات تایید شبکه، قیمت نهایی و زمان تسویه در جزییات سفارش فروش قابل مشاهده است.",
        ],
      },
      {
        title: "چه مدت طول میکشه تا فروش ارز من در شبکه تایید شود؟",
        lines: [
          "مدت زمان تایید شناسه تراکنش یا txid در شبکه با توجه به سختی شبکه و میزان کارمزدی که شما برای انتقال ارز مشخص میکنید، می تواند از یک دقیقه تا چند روز به طول انجامد، ‌لطفا تا تایید شناسه پرداخت در شبکه بلاکچین شکیبا باشید. ",
        ],
      },
    ],
  },
  {
    title: "زمان انجام معاملات",
    items: [
      {
        title: "زمان انجام معاملات چه ساعتی است؟",
        lines: ["انجام معاملات خرید و فروش در کریپو، شبانه روزی است."],
      },
      {
        title: "آیا در روزهای تعطیل معامله انجام می‌شود؟",
        lines: ["بله"],
      },
      {
        title: "دریافت و ارسال ارز چقدر طول می‌کشد؟",
        lines: [
          "سامانه پرداخت الکترونیک کریپو، در لحظه ارز مورد نظر شما را خریداری میکند و با توجه به دستور مقامات محترم قضایی و انتظامی، خرید اول بعد از ثبت خرید، تکمیل و تایید احراز هویت در وقت اداری و خرید های بعدی آنی بعد از ثبت سفارش به کیف پول شما ارسال می گردد.",
          "برای اطلاع از زمان واریز ارز به بخش سفارشات خود در منو سایت مراجعه کنید.",
        ],
      },
      {
        title: "دریافت و ارسال ریال چقدر طول می‌کشد؟",
        lines: [
          "به شرط احراز هویت و تایید تراکنش در شبکه بلاکچین ، در صورتی که زمان ثبت سفارش تسویه از طریق کیف پول ریالی را انتخاب کنید، سامانه پرداخت الکترونیک کریپو به صورت آنی واریز ریال را انجام میدهد . ",
          "در صورتی که زمان ثبت سفارش تسویه از شبای بانکی را انتخاب کنید، بانک آینده: 15 دقیقه پس از تایید شبکه و سایر بانک ها طبق قانون پایا بانک مرکزی در چهار نوبت 04‪:‬00 بامداد، 11‪:‬00 صبح، 14‪:‬00 بعدازظهر و 19‪:‬00 عصر در روزهای کاری واریز انجام میشود.لازم به ذکر است که در روزهای تعطیل پایا از سمت بانک انجام نخواهد شد و واریز آن به ابتدای روز کاری آتی موکول میگردد.",
          "(لازم به ذکر است مبنای تسویه هر سفارش پیش فاکتور بوده و شما کاربر گرامی می توانید هنگام فروش و در پیش فاکتور هرگونه تغییر در زمان تسویه را مشاهده فرمایید.)",
        ],
      },
    ],
  },
  {
    title: "کیف پول",
    items: [
      {
        title: "چگونه می‌توانم یک کیف پول ارز دیجیتال بسازم؟",
        lines: [
          "کریپو سرویس کیف پول ارائه نمی‌دهد اما اگر شما به دنبال یک کیف پول امن، سریع و آسان هستید که تنوع گسترده‌ای از آلت کوین ها را پشتیبانی کند، کیف پول تراست ولت یکی از گزینه‌هایی است که با آن می‌توانید ارزهای دیجیتال را بر روی تلفن همراه خود ذخیره کنید.",
          "برای ساخت کیف پول میتوانید در منو سایت به قسمت ساخت کیف پول مراجعه نمایید.",
        ],
      },
    ],
  },
  {
    title: "کیف پول ریالی",
    items: [
      {
        title: "کیف پول ریالی چیست؟",
        lines: [
          "شما می توانید در بخش کیف پول ریالی کریپو:",
          "موجودی ریالی خود را بررسی بفرمایید.",
          "موجودی ریالی خود را افزایش دهید .",
          "درخواست برداشت وجه ریالی ثبت کنید.",
          "تاریخچه واریز و برداشت ریال را مشاهده کنید.",
        ],
      },
      {
        title: "نحوه ی برداشت ریال از کیف پول ریالی کریپو چگونه است؟",
        lines: [
          "برای برداشت وجه ریالی در صفحه اصلی کریپو روی نام کاربری خود انتخاب کنید، وارد بخش کیف پول ریالی شوید، روی گزینه برداشت وجه انتخاب کنید، مبلغ مورد نظرتون را با توجه به موجودی خود در بخش مبلغ برداشت به تومان وارد کنید.",
          "شبای مورد نظر خود را از بین شباهای ثبت شده در پروفایلتون انتخاب کنید.",
          "در خواست برداشت وجهتان را ثبت کنید.",
          "منتظر تایید و واریز به شبای مربوطه باشید.",
        ],
      },
    ],
  },
  {
    title: "پرتفوی",
    items: [
      {
        title: "پرتفوی چیست؟",
        lines: [
          "در این قسمت شما می توانید با استفاده از گزینه افزودن ارز جدید، انتخاب ارز مورد نظر و تعیین مبلغ پرداختی و مقدار ارز دریافتی و ثبت مورد خود با استفاده از گزینه افزودن دارایی های خود را رصد کنید.",
          "دقت کنید که تمامی مواردی که در این بخش مشاهده می کنید به تومان می باشد و قیمت فروش ارز می باشد نه قیمت خرید ارز شما.",
        ],
      },
    ],
  },
  {
    title: "بیت گپ",
    items: [
      {
        title: "بیت گپ چیست؟",
        lines: [
          "بیت گپ فضای گفتگو و تبادل نظر کاربران در زمینه ارز های دیجیتال است. کاربران می‌توانند در فضای بیت گپ به طرح مسائل و گفتگو پیرامون آن بپردازند.",
        ],
      },
      {
        title: "قوانین فعالیت در بیت گپ",
        lines: [
          "- احترام به قوانین کشور و عدم توهین و اظهار نظرهای سیاسی و اجتماعی",
          "- در محیط بیت گپ فقط در خصوص ارزهای دیجیتال و مطالب پیرامون آن امکان بحث و تبادل نظر می باشد",
          "- رعایت اخلاق و ادب در برخورد با سایر کاربران",
          "- عدم تبلیغ برای سایر سایت ها و مجموعه ها",
          "- عدم رفرال گیری و تبلیغ برای سایت ها و پروژه های پانزی",
          "- عدم ارائه و درخواست شماره تماس و آی دی در محیط بیت گپ",
        ],
      },
      {
        title: "علت مسدود شدن کاربر در بیت گپ",
        lines: [
          "در صورتی که مطلب ارسالی شما خلاف قوانین بیت گپ باشد، مطلب ارسالی اصلاح یا حذف خواهد شد. در این شرایط  کاربر به مدت ۲۴ ساعت امکان ارسال مطلب در بیت گپ را ندارد و در صورت تکرار، در مرتبه دوم این محدودیت ۷۲ ساعت خواهد بود و در مرتبه سوم کاربر به صورت دائمی از فعالیت در بیت گپ محروم خواهد شد.",
        ],
      },
      {
        title: "تبلیغ در بیت گپ",
        lines: [
          "ارسال تبلیغات خرید و فروش در بیت گپ و دعوت به کانال ها و فضاهای خرید و فروش ارز دیجیتال ممنوع می‌باشد.",
        ],
      },
    ],
  },
  {
    title: "اپلیکیشن کریپو",
    items: [
      {
        title: "کریپو در چه نسخه هایی در دسترس است؟",
        lines: [
          "نسخه اپلیکیشن کریپو روی پلتفرم های اندروید و آیفون منتشر شده و از طریق لینک های زیر میتوانید دریافت کنید.",
          "دریافت از گوگل پلی <a href='https://play.google.com/store/apps/details?id=com.crypto.app' target='_blank' rel='noreferrer noopener'>اینجا</a> کلیک کنید.",
          "دریافت از کافه بازار <a href='https://cafebazaar.ir/app/com.crypto.app' target='_blank' rel='noreferrer noopener'>اینجا</a> کلیک کنید.",
          "دریافت از سیبچه <a href='https://sibche.com/applications/crypto' target='_blank' rel='noreferrer noopener'>اینجا</a> کلیک کنید.",
          "دریافت از اناردونی <a href='https://anardoni.com/ios/app/7JEWt6kBE' target='_blank' rel='noreferrer noopener'>اینجا</a> کلیک کنید.",
        ],
      },
    ],
  },
  {
    title: "استخراج ارز",
    items: [
      {
        title: "پیشنهاد کریپو برای ماینینگ به صورت کلی چیست؟",
        lines: [
          "کریپو هر گونه استخراج (ماینینگ) ارز را در حال حاضر مقرون بصرفه نمی داند. پیشنهاد کریپو خرید و فروش ارزهای دیجیتال است. شما بیت‌کوین را با قیمت پایین می‌خرید و زمانیکه قیمت بیت کوین بالا کشید آن را با قیمت بیشتر در کریپو به فروش می‌رسانید.",
        ],
      },
      {
        title: "آیا ماینینگ با موبایل به صرفه است؟!",
        lines: [
          "با نصب برنامه‌های استخراج ارز نه تنها فضای آزاد گوشی خود را مصرف می‌کنید بلکه باید به این نکته هم دقت کنید که اجرای این برنامه‌ها در پس‌زمینه به میزان قابل توجهی باعث گرم شدن گوشی شما شده، باعث تخلیه زودهنگام باتری (تنها در چند ساعت) و در نهایت عمر مفید دستگاه شما را کاهش می‌دهد و در آخر پس از ماهها استخراج ارز و مستهلک کردن گوشی یا کامپیوتر شخصی تنها درآمد چند صد هزار تومانی خواهید داشت که این رقم در مقایسه با قیمت گوشی یا کامپیوتر خود رقم بسیار ناچیزی است.",
        ],
      },
    ],
  },
  {
    title: "اعتبار کریپو",
    items: [
      {
        title: "با وجود نداشتن نماد اعتماد چطور میتونم به کریپو اعتماد کنم؟",
        lines: [
          "شما در ابتدا می توانید با درخواست های کوچکتر شروع کنید و به مرور پس از کسب اطمینان از کریپو اقدام به درخواست های بزرگتر نمایید.",
          "شما با مراجعه به بخش نظرات می توانید از نقطه نظر سایر کاربران نسبت به کریپو آگاه شوید. در ضمن درگاه بانکی سایت بنام کریپو است و مورد تایید بانک می باشد.",
          "پیشنهاد کریپو به شما این است که در ابتدا برای کسب اعتماد با درخواست های کوچکتر شروع کنید و به مرور پس از کسب اطمینان از کریپو، اقدام به درخواست های بزرگتر نمایید.",
        ],
      },
      {
        title: "چرا بیت‌برگ نماد اعتماد الکترونیک ندارد؟",
        lines: [
          "از آنجاییکه قانونی برای ارزهای دیجیتال در کشور تصویب نشده است به همین دلیل به سایتهای فعال در حوزه ارزهای دیجیتال، نماد اعتماد الکترونیک تعلق نمی گیرد.",
        ],
      },
    ],
  },
];
type PropTypes = {};
export default function FaqPage(props: PropTypes) {
  const [inputValue, setSearched] = useState("");
  const handleInputValueChange = (e: any) => setSearched(e?.target?.value);

  const categories = useMemo(() => {
    if (!inputValue) return _categories;
    const filtered: any = [];
    _categories.forEach((category) => {
      const filteredItems = category.items.filter(({ title, lines }) => {
        return (title + lines.join(" ")).includes(inputValue);
      });
      if (filteredItems.length) {
        filtered.push({
          title: category.title,
          items: filteredItems,
        });
      }
    });
    return filtered;
  }, [inputValue]);

  return <FaqView {...{ categories, inputValue, handleInputValueChange }} />;
}
